tutorials/FF/dambreak/interFoam-interFoam_unidirectional/Fluid2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xleft 10;
xmiddle 15;
xright 20;

ybottom 0;
ymiddle 5;
ytop 10;

zback 0;
zmiddle 5;
zfront 10;

vertices
(
    ($xleft $ybottom $zfront) //0
    ($xright $ybottom $zfront) //1
    ($xright $ybottom $zback) //2
    ($xleft $ybottom $zback) //3
    ($xleft $ytop $zfront) //4
    ($xright $ytop $zfront) //5
    ($xright $ytop $zback) //6
    ($xleft $ytop $zback) //7

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 30 30) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall_inlet
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
        (5 6 7 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
